Robot-App/app/controllers/api/robots_controller.rb

SELECT "robots".* FROM "robots" WHERE "robots"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_robot
      @robot = Robot.find(params[:id])

UPDATE "robots" SET "is_placed" = $1, "updated_at" = $2 WHERE "robots"."id" = $3  [["is_placed", true], ["updated_at", "2020-10-31 09:42:35.286257"], ["id", 1]]
---
    def check_robot_is_on_table?
      if @robot.is_placed
        true
      elsif params[:commands][0] == "PLACE"
        @robot.update(is_placed: true)